# IsRightHanded Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CylindricalHelix..::..IsRightHanded Property
CylindricalHelix Class See Also
---
True if the helix is right handed, false if the helix is left handed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsRightHanded { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsRightHanded As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsRightHanded {
	bool get ();
}
```

# See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace